In [ ]:
# Pandas

# used for data manipulation and analysis
# it internally used numpy
# relational data - data which is related to one another, e.g excel where data of one column is related to the data of the other column

In [1]:
# importing pandas

import pandas as pd
import numpy as np

In [ ]:
# Series
# In pandas single dimensional array is known as Series
# Series can be hetrogenous too, meaning a series can contains different data types
# Dictionaries can also passed in Series() function, here Keys are considered as indexes and values as data of series

ser = pd.Series([10,20,30,40,50])

print(type(ser))
print(ser)

<class 'pandas.core.series.Series'>
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [ ]:
# assigining index and coumn name for a series

ser1 = pd.Series([10,20,30,40,50], index=['a','b','c','d','e'], name='data values')

print(type(ser1))
print(ser1)

<class 'pandas.core.series.Series'>
a    10
b    20
c    30
d    40
e    50
Name: data values, dtype: int64

In [ ]:
# Creating series using dictionary

ser2 = pd.Series({'a':10,'b':20,'c':30})

print(type(ser2))
print(ser2)

<class 'pandas.core.series.Series'>
a    10
b    20
c    30
dtype: int64

In [ ]:
# Attributes of Series

print(ser2.values)
print(ser2.index)
print(ser2.dtype)
print(ser2.name)
print(ser2.shape)
print(ser2.size)
print(ser2.empty)

[10 20 30]
Index(['a', 'b', 'c'], dtype='object')
int64
None
(3,)
3
False

In [ ]:
# Indexing

# positional indexing - indexing the value using the position of the data among the Series (python list indexing)
# Native indexing     - indexing the value using the index that have created automatically or by the user

print(ser2.values[0])  # positionl indexing

print(ser2.loc['b'])       # .loc[] is used for native indexing
print(ser2.iloc[1])        # .iloc is used for positional indexing

print(ser2[0])           # this type of indexing is not used in the latest version
                         # if there is a index named 0 then ser[0] picks 0 by Native indexing instead of positional indexing

10
20
20
10

/tmp/ipython-input-4-189071710.py:11: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(ser2[0])           # this type of indexing is not used in the latest version

In [ ]:
print(ser2.loc[['a','b']])  # indexing multiple rows or values
print(ser2.iloc[[0, 1]])

a    10
b    20
dtype: int64
a    10
b    20
dtype: int64

In [ ]:
# slicing

# loc(start:end) -> end is inclusive
# iloc(start:end)-> end is exclusinve

ser = pd.Series([10,20,30,40,50], index = [11, 12, 13, 14, 15])

print(ser.iloc[0:2])
print(ser.loc[11:14])
print(ser2.loc['a':'c'])     # .loc() function will include the end number also

11    10
12    20
dtype: int64
11    10
12    20
13    30
14    40
dtype: int64
a    10
b    20
c    30
dtype: int64

In [ ]:
# DataFrame

# the object that wraps multiple pandas series or columns are DataFrame
# it is a collection of pandas series

In [ ]:
# Creating DataFrame

data = {
    'Name': ['apple', 'mango', 'grape'],
    'color': ['red', 'yellow', 'green'],
    'price': [100, 200, 300]
}

df = pd.DataFrame(data)

print(df)

    Name   color  price
0  apple     red    100
1  mango  yellow    200
2  grape   green    300

In [ ]:
# creating dataframe from json type dictionary

data_1 = [
    {'Name':'apple', 'color':'red', 'price':100},
    {'Name':'mango', 'color':'yellow', 'price':200},
    {'Name':'grape', 'color':'green', 'price':300}
]

df1 = pd.DataFrame(data_1)

print(df1)

    Name   color  price
0  apple     red    100
1  mango  yellow    200
2  grape   green    300

In [ ]:
data = np.array([[1, 2], [3, 4], [5, 6]])
df = pd.DataFrame(data, columns=['A', 'B'])    # columns is used to assign the column name and index is used to assign index of the row
print(df)
print(type(df))

   A  B
0  1  2
1  3  4
2  5  6
<class 'pandas.core.frame.DataFrame'>

In [ ]:
# Accessing the values in dataframe

data = {
    'Name': ['apple', 'mango', 'grape'],
    'color': ['red', 'yellow', 'green'],
    'price': [100, 200, 300]
}
df = pd.DataFrame(data)

print(df['Name'])                # accessing only the 'Name' Column
print(type(df['Name']))          # single column is considered as Series in pandas

print(df[['Name', 'color']])     # accessing multiple columns
print(type(df[['Name', 'color']]))

0    apple
1    mango
2    grape
Name: Name, dtype: object
<class 'pandas.core.series.Series'>
    Name   color
0  apple     red
1  mango  yellow
2  grape   green
<class 'pandas.core.frame.DataFrame'>

In [ ]:
print(df.loc[0:1])    # 1 is included
print()
print(df.iloc[0:1])   # 1 is excluded

    Name   color  price
0  apple     red    100
1  mango  yellow    200

    Name color  price
0  apple   red    100

In [ ]:
# Data Formats

# CSV
# JSON
# XML

In [2]:
# Reading data from CSV

data_csv = "https://raw.githubusercontent.com/datasciencedojo/datasets/refs/heads/master/titanic.csv"

df = pd.read_csv(data_csv)    # reading CSV file using read_csv() funciton

print(df)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [ ]:
# Visuvalization

# top 5 rows
print(df.head(5))

print("="*100)

#last 5 rows
print(df.tail(5))

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
====================================================================================================
     PassengerId  Survived  Pclass                                      Name  \
886          887         0       2                     Montvila, Rev. Juozas
887          888         1       1              Graham, Miss. Margaret Edith
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"
889          890         1       1                     Behr, Mr. Karl Howell
890          891         0       3                       Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch      Ticket   Fare Cabin Embarked
886    male  27.0      0      0      211536  13.00   NaN        S
887  female  19.0      0      0      112053  30.00   B42        S
888  female   NaN      1      2  W./C. 6607  23.45   NaN        S
889    male  26.0      0      0      111369  30.00  C148        C
890    male  32.0      0      0      370376   7.75   NaN        Q

In [ ]:
# getting a columns

print(df[['Name','Age']])

                                                  Name   Age
0                              Braund, Mr. Owen Harris  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                             Allen, Mr. William Henry  35.0
..                                                 ...   ...
886                              Montvila, Rev. Juozas  27.0
887                       Graham, Miss. Margaret Edith  19.0
888           Johnston, Miss. Catherine Helen "Carrie"   NaN
889                              Behr, Mr. Karl Howell  26.0
890                                Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]

In [ ]:
# loc in df

print(df.loc[0])

print("="*100)

print(df.loc[0, 'Name'])      # In loc[] we can access the column using the column name

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object
====================================================================================================
Braund, Mr. Owen Harris

In [ ]:
# iloc

print(df.iloc[0])

print("="*100)

print(df.iloc[0, 3])        # In loc[] we can access the column using the column index

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object
====================================================================================================
Braund, Mr. Owen Harris

In [ ]:
# conditional formatting

print(df[df['Age'] > 30])

     PassengerId  Survived  Pclass  \
1              2         1       1
3              4         1       1
4              5         0       3
6              7         0       1
11            12         1       1
..           ...       ...     ...
873          874         0       3
879          880         1       1
881          882         0       3
885          886         0       3
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
6                              McCarthy, Mr. Timothy J    male  54.0      0
11                            Bonnell, Miss. Elizabeth  female  58.0      0
..                                                 ...     ...   ...    ...
873                        Vander Cruyssen, Mr. Victor    male  47.0      0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0
881                                 Markun, Mr. Johann    male  33.0      0
885               Rice, Mrs. William (Margaret Norton)  female  39.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch    Ticket     Fare Cabin Embarked
1        0  PC 17599  71.2833   C85        C
3        0    113803  53.1000  C123        S
4        0    373450   8.0500   NaN        S
6        0     17463  51.8625   E46        S
11       0    113783  26.5500  C103        S
..     ...       ...      ...   ...      ...
873      0    345765   9.0000   NaN        S
879      1     11767  83.1583   C50        C
881      0    349257   7.8958   NaN        S
885      5    382652  29.1250   NaN        Q
890      0    370376   7.7500   NaN        Q

[305 rows x 12 columns]

In [ ]:
print(df['Age'] > 30)

0      False
1       True
2      False
3       True
4       True
       ...
886    False
887    False
888    False
889    False
890     True
Name: Age, Length: 891, dtype: bool

In [ ]:
# get the females who survived

# dataframe will only accept &,|,~
# it doesn't accept and, or, not

print(df[(df['Sex'] == 'female') & (df['Survived'] == 1)])        # 'and' will not work here only use '&'

     PassengerId  Survived  Pclass  \
1              2         1       1
2              3         1       3
3              4         1       1
8              9         1       3
9             10         1       2
..           ...       ...     ...
874          875         1       2
875          876         1       3
879          880         1       1
880          881         1       2
887          888         1       1

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
..                                                 ...     ...   ...    ...
874              Abelson, Mrs. Samuel (Hannah Wizosky)  female  28.0      1
875                   Najib, Miss. Adele Kiamie "Jane"  female  15.0      0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0
880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0

     Parch            Ticket     Fare Cabin Embarked
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
8        2            347742  11.1333   NaN        S
9        0            237736  30.0708   NaN        C
..     ...               ...      ...   ...      ...
874      0         P/PP 3381  24.0000   NaN        C
875      0              2667   7.2250   NaN        C
879      1             11767  83.1583   C50        C
880      1            230433  26.0000   NaN        S
887      0            112053  30.0000   B42        S

[233 rows x 12 columns]

In [ ]:
# filtering the dataframe, after that only getting required columns
# df[df[conditins]][columns]  =>  df[df[conditins]] gives a dataframe and then applying [columns] on df[df[conditins]]

female_survived = df[(df['Sex'] == 'female') & (df['Survived'] == 1)][['Name', 'Age']]

print(female_survived)

                                                  Name   Age
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0
9                  Nasser, Mrs. Nicholas (Adele Achem)  14.0
..                                                 ...   ...
874              Abelson, Mrs. Samuel (Hannah Wizosky)  28.0
875                   Najib, Miss. Adele Kiamie "Jane"  15.0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  56.0
880       Shelley, Mrs. William (Imanita Parrish Hall)  25.0
887                       Graham, Miss. Margaret Edith  19.0

[233 rows x 2 columns]

In [5]:
# filtering using .loc[]

female_survived_df = df.loc[(df['Sex'] == 'female') & (df['Survived'] == 1), ['Name', 'Age']]
print(female_survived_df)

                                                  Name   Age
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0
9                  Nasser, Mrs. Nicholas (Adele Achem)  14.0
..                                                 ...   ...
874              Abelson, Mrs. Samuel (Hannah Wizosky)  28.0
875                   Najib, Miss. Adele Kiamie "Jane"  15.0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  56.0
880       Shelley, Mrs. William (Imanita Parrish Hall)  25.0
887                       Graham, Miss. Margaret Edith  19.0

[233 rows x 2 columns]

In [ ]:
# Female survived number

print(len(female_survived))

233

In [3]:
survived = len(df[df['Survived'] == 1])
notSurvived = len(df[df['Survived'] == 0])
total = len(df)

print("Survived     = ",survived)
print("Not survived = ",notSurvived)
print("Total        = ",total)

print("Survived Percent     = ",survived/total)
print("Not Survived Percent = ",notSurvived/total)

Survived     =  342
Not survived =  549
Total        =  891
Survived Percent     =  0.3838383838383838
Not Survived Percent =  0.6161616161616161

In [9]:
# slicing

print(df.loc[0:2, ['Age', 'Name']])

print("="*100)

print(df.iloc[0:2, 0:2])     # iloc[] 2nd arguments doesnot takes names as arguments

    Age                                               Name
0  22.0                            Braund, Mr. Owen Harris
1  38.0  Cumings, Mrs. John Bradley (Florence Briggs Th...
2  26.0                             Heikkinen, Miss. Laina
====================================================================================================
   PassengerId  Survived
0            1         0
1            2         1

In [ ]:
# Chained indexing

# df[[col1,col2]][col2] ->  this type of selection is chainned indexin
# here df[[col1,col2]] is chainned with [col2]
# chained indexing is not preferrable for use, mainly in case of modifying the values of received df
# use .loc[] to avoid problem with chainned indexing

In [24]:
# the below codes may or maynot create a veiw or copy
# it is highly imposible to predict
# copy of df will be created if most complex filter or chained indexing is used

# subset = df.iloc[]
# subset = df.loc[]
# subset = def[(multiple-columns)]
# subsset = df[(single-column)]

# hence it is not predectable whether we get veiw or copy while getting subset
# always use .copy() if you want a definite copy

data = {
    'Name': ['apple', 'mango', 'grape'],
    'color': ['red', 'yellow', 'green'],
    'price': [100, 200, 300]
}
df1 = pd.DataFrame(data)

subset1 = df1.loc[0:2, ['Name', 'price']]
print("subset1")
print(subset1)                          # subset1 is view which will effect the original df1

subset1['price'] = subset1['price'] + 50
print("subset1 \n", subset1)

print("Original \n", df1[['Name', 'price']])
print("="*100)

# using copy() method

subset1 = df1.loc[0:2, ['Name', 'price']].copy()
print(subset1)                          # using copy() will create a copy of given df so, subset will not effect original df1

subset1
    Name  price
0  apple    100
1  mango    200
2  grape    300
subset1
     Name  price
0  apple    150
1  mango    250
2  grape    350
Original
     Name  price
0  apple    100
1  mango    200
2  grape    300
====================================================================================================
    Name  price
0  apple    100
1  mango    200
2  grape    300

In [25]:
data = {
    'Name': ['apple', 'mango', 'grape'],
    'color': ['red', 'yellow', 'green'],
    'price': [100, 200, 300]
}
df1 = pd.DataFrame(data)

subset2 = df1.iloc[0:3, [0,2]]
print("subset2")
print(subset2)                          # subset1 is view which will effect the original df1

subset2['price'] = subset2['price'] + 50
print("subset1 \n", subset2)

print("Original \n", df1[['Name', 'price']])
print("="*100)

# using copy() method

subset2 = df1.iloc[0:3, [0,2]].copy()
print(subset2)                          # using copy() will create a copy of given df so, subset will not effect original df1

subset2
    Name  price
0  apple    100
1  mango    200
2  grape    300
subset1
     Name  price
0  apple    150
1  mango    250
2  grape    350
Original
     Name  price
0  apple    100
1  mango    200
2  grape    300
====================================================================================================
    Name  price
0  apple    100
1  mango    200
2  grape    300

In [26]:
data = {
    'Name': ['apple', 'mango', 'grape'],
    'color': ['red', 'yellow', 'green'],
    'price': [100, 200, 300]
}
df1 = pd.DataFrame(data)

subset3 = df1[['Name', 'price']]
print("subset3")
print(subset3)                          # subset1 is view which will effect the original df1

subset3['price'] = subset3['price'] + 50
print("subset3 \n", subset3)

print("Original \n", df1[['Name', 'price']])
print("="*100)

# using copy() method

subset3 = df1[['Name', 'price']].copy()
print(subset3)                          # using copy() will create a copy of given df so, subset will not effect original df1

subset3
    Name  price
0  apple    100
1  mango    200
2  grape    300
subset3
     Name  price
0  apple    150
1  mango    250
2  grape    350
Original
     Name  price
0  apple    100
1  mango    200
2  grape    300
====================================================================================================
    Name  price
0  apple    100
1  mango    200
2  grape    300

/tmp/ipython-input-26-528302636.py:12: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  subset3['price'] = subset3['price'] + 50

In [31]:
# Setting and Unsetting index

data = {
    'Name': ['apple', 'mango', 'grape'],
    'color': ['red', 'yellow', 'green'],
    'price': [100, 200, 300]
}
df1 = pd.DataFrame(data)

print(df1)
print("="*100)

df2 = df1.set_index('Name')    # setting a column as index

print(df2)
print("="*100)

df2 = df2.reset_index()        # reverting back or reset the index to 0 to ....
print(df2)

    Name   color  price
0  apple     red    100
1  mango  yellow    200
2  grape   green    300
====================================================================================================
        color  price
Name
apple     red    100
mango  yellow    200
grape   green    300
====================================================================================================
    Name   color  price
0  apple     red    100
1  mango  yellow    200
2  grape   green    300

In [45]:
# Reindexing

# if two df or pandas series contains data regarding the same thing but with some missing or updated rows or data in one of the df Reindexing is used
# if df1 has s1, s2, s3 data and df2 has only s1 and s3 data, then we need to have the s2 data in df2 to process the both dfs in similar way

# Reindexing is used to alter the one of df index in occurding to other df's index

# example
data = {
    'Name': ['apple', 'mango', 'grape'],
    'color': ['red', 'yellow', 'green'],
    'price_1': [100, 200, 300]
}
df1 = pd.DataFrame(data)
df1.set_index('Name', inplace=True)
print("df1\n",df1)
print("="*100)

data = {
    'Name': ['apple', 'grape'],
    'color': ['red', 'green'],
    'price_2': [110, 290]
}
df2 = pd.DataFrame(data)
df2.set_index('Name', inplace=True)
print("df2\n",df2)
print("="*100)

df2 = df2.reindex(df1.index, fill_value=0)     # here index of df2 is changed in accordance with df1, we can also change df1 index with accourdance with df2 index
                                               # the rows can be removed or added based on which index is used to reindex
                                               # fill_value in default fill with NaN

print("df2\n",df2)

df1
         color  price_1
Name
apple     red      100
mango  yellow      200
grape   green      300
====================================================================================================
df2
        color  price_2
Name
apple    red      110
grape  green      290
====================================================================================================
df2
        color  price_2
Name
apple    red      110
mango      0        0
grape  green      290

In [ ]:
'df2 = df2.reindex(df1.index, fill_value=0)'

# fill_value will only fill all the NaN values to a same single value that we have given
# if we want to fill different values for different columns we have to use .fillna() function

# if we want to reindex based on columns then change the index using ste_index() function and perform reindex() and then reset_index()
'df = df.set_index("Name").reindex(new_names).reset_index()'

In [51]:
# if we want to add a column instead of index in accourdance with other df then

data = {
    'Name': ['apple', 'mango', 'grape'],
    'color': ['red', 'yellow', 'green'],
    'price_1': [100, 200, 300]
}
df1 = pd.DataFrame(data)
print("df1\n",df1)
print("="*100)

data = {
    'Name': ['apple', 'mango', 'grape'],
    'price_1': [110, 200, 290]
}
df2 = pd.DataFrame(data)
print("df2\n",df2)
print("="*100)

df2 = df2.reindex(columns=df1.columns, fill_value='unknown')   # in df2 'color' column is added and filled with fill_value
print("df2\n", df2)

df1
     Name   color  price_1
0  apple     red      100
1  mango  yellow      200
2  grape   green      300
====================================================================================================
df2
     Name  price_1
0  apple      110
1  mango      200
2  grape      290
====================================================================================================
df2
     Name    color  price_1
0  apple  unknown      110
1  mango  unknown      200
2  grape  unknown      290

In [61]:
# iteration in dataframe

data = {
    'Name': ['apple', 'mango', 'grape'],
    'color': ['red', 'yellow', 'green'],
    'price_1': [100, 200, 300]
}
df1 = pd.DataFrame(data)

for i, rows in df1.iterrows():                   # iterating over rows-> will give both index and row datas
  print(f"Index = {i} fruit is {rows.Name} with color {rows.color} with price {rows.price_1}")

print()
for rows in df1.itertuples():                    # iterating happen over rows but gives in the format like tuples which contains index and all the columns data
  print(f"Index = {rows.Index} fruit is {rows.Name} with color {rows.color} with price {rows.price_1}")

print()
for i in df1.columns:
  print(i)

Index = 0 fruit is apple with color red with price 100
Index = 1 fruit is mango with color yellow with price 200
Index = 2 fruit is grape with color green with price 300

Index = 0 fruit is apple with color red with price 100
Index = 1 fruit is mango with color yellow with price 200
Index = 2 fruit is grape with color green with price 300

Name
color
price_1

In [65]:
data = {
    'Name': ['apple', 'mango', 'grape'],
    'color': ['red', 'yellow', 'green'],
    'price': [100, 200, 300]
}
df1 = pd.DataFrame(data)

In [66]:
# Creating new columns using condition

df_new = df1.copy()
values = []

# itering over rows and creating a list for new column based on the condition on a certain column
for i, row in df_new.iterrows():
  if row["price"] > 175:
    values.append("High")
  else:
    values.append("Low")

df_new["Values"] = values

print(df_new)

    Name   color  price Values
0  apple     red    100    Low
1  mango  yellow    200   High
2  grape   green    300   High

In [67]:
# using apply

df_new = df1.copy()

# apply() will accept the function where the values of the new column is determined
df_new["Value"] = df_new['price'].apply(lambda price: "High" if price>175 else "Low")

print(df_new)

    Name   color  price Value
0  apple     red    100   Low
1  mango  yellow    200  High
2  grape   green    300  High

In [95]:
# Reading data from CSV

data_csv = "https://raw.githubusercontent.com/datasciencedojo/datasets/refs/heads/master/titanic.csv"

df = pd.read_csv(data_csv)    # reading CSV file using read_csv() funciton

print(df.columns)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [83]:
# sorting

# Sorting based on Age

sortedDf = df.sort_values(by="Age", ascending = False)

print(sortedDf[["Name", "Age"]].head(10))

print("="*100)

print(sortedDf.iloc[0:100, 3:6])

print("="*100)

print(sortedDf.loc[96:873, ["Name", "Age"]])

                                     Name   Age
630  Barkworth, Mr. Algernon Henry Wilson  80.0
851                   Svensson, Mr. Johan  74.0
493               Artagaveytia, Mr. Ramon  71.0
96              Goldschmidt, Mr. George B  71.0
116                  Connors, Mr. Patrick  70.5
745          Crosby, Capt. Edward Gifford  70.0
672           Mitchell, Mr. Henry Michael  70.0
33                  Wheadon, Mr. Edward H  66.0
456             Millet, Mr. Francis Davis  65.0
54         Ostby, Mr. Engelhart Cornelius  65.0
====================================================================================================
                                     Name   Sex   Age
630  Barkworth, Mr. Algernon Henry Wilson  male  80.0
851                   Svensson, Mr. Johan  male  74.0
493               Artagaveytia, Mr. Ramon  male  71.0
96              Goldschmidt, Mr. George B  male  71.0
116                  Connors, Mr. Patrick  male  70.5
..                                    ...   ...   ...
873           Vander Cruyssen, Mr. Victor  male  47.0
110        Porter, Mr. Walter Chamberlain  male  47.0
586               Jarvis, Mr. John Denzil  male  47.0
397               McKane, Mr. Peter David  male  46.0
92            Chaffee, Mr. Herbert Fuller  male  46.0

[100 rows x 3 columns]
====================================================================================================
                                                 Name   Age
96                          Goldschmidt, Mr. George B  71.0
116                              Connors, Mr. Patrick  70.5
745                      Crosby, Capt. Edward Gifford  70.0
672                       Mitchell, Mr. Henry Michael  70.0
33                              Wheadon, Mr. Edward H  66.0
..                                                ...   ...
592                        Elsbury, Mr. William James  47.0
662                        Colley, Mr. Edward Pomeroy  47.0
132    Robins, Mrs. Alexander A (Grace Charity Laury)  47.0
871  Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  47.0
873                       Vander Cruyssen, Mr. Victor  47.0

[93 rows x 2 columns]

In [97]:
# Sorting multiple columns

sortedDf = df.sort_values(by=["Pclass", "Fare"], ascending = [True, False])  # ascending parameter can also be specified for each column

print(sortedDf[["Pclass", "Fare"]].head(10))

     Pclass      Fare
258       1  512.3292
679       1  512.3292
737       1  512.3292
27        1  263.0000
88        1  263.0000
341       1  263.0000
438       1  263.0000
311       1  262.3750
742       1  262.3750
118       1  247.5208

In [94]:
# fillna and type casting

# fillna fills the "NaN" with given values

# astype(int) will convert the datatype of the column

newDf = sortedDf[["Name", "Age"]].tail(50).copy()
print(newDf.tail(10))

newDf["Age"] = newDf["Age"].fillna(1)                   # fills all the "NaN values with 1

print("="*100)
print(newDf.tail(10))

newDf["Age"] = newDf["Age"].astype("int64")                  # astype("int64") will convert the datatype of the column into int

print("="*100)
print(newDf.tail(10))

                                             Name  Age
832                                Saad, Mr. Amin  NaN
837                           Sirota, Mr. Maurice  NaN
839                          Marechal, Mr. Pierre  NaN
846                      Sage, Mr. Douglas Bullen  NaN
849  Goldenberg, Mrs. Samuel L (Edwiga Grabowska)  NaN
859                              Razi, Mr. Raihed  NaN
863             Sage, Miss. Dorothy Edith "Dolly"  NaN
868                   van Melkebeke, Mr. Philemon  NaN
878                            Laleff, Mr. Kristo  NaN
888      Johnston, Miss. Catherine Helen "Carrie"  NaN
====================================================================================================
                                             Name  Age
832                                Saad, Mr. Amin  1.0
837                           Sirota, Mr. Maurice  1.0
839                          Marechal, Mr. Pierre  1.0
846                      Sage, Mr. Douglas Bullen  1.0
849  Goldenberg, Mrs. Samuel L (Edwiga Grabowska)  1.0
859                              Razi, Mr. Raihed  1.0
863             Sage, Miss. Dorothy Edith "Dolly"  1.0
868                   van Melkebeke, Mr. Philemon  1.0
878                            Laleff, Mr. Kristo  1.0
888      Johnston, Miss. Catherine Helen "Carrie"  1.0
====================================================================================================
                                             Name  Age
832                                Saad, Mr. Amin    1
837                           Sirota, Mr. Maurice    1
839                          Marechal, Mr. Pierre    1
846                      Sage, Mr. Douglas Bullen    1
849  Goldenberg, Mrs. Samuel L (Edwiga Grabowska)    1
859                              Razi, Mr. Raihed    1
863             Sage, Miss. Dorothy Edith "Dolly"    1
868                   van Melkebeke, Mr. Philemon    1
878                            Laleff, Mr. Kristo    1
888      Johnston, Miss. Catherine Helen "Carrie"    1

In [109]:
# Sort index

# sort the df based on the index

newDf = df.set_index("PassengerId")

print(newDf[["Name", "Age"]])

print("="*100)

sortedDf = newDf.sort_index(ascending = False)   # sorted based on index

print(sortedDf[["Name", "Age"]])

                                                          Name   Age
PassengerId
1                                      Braund, Mr. Owen Harris  22.0
2            Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
3                                       Heikkinen, Miss. Laina  26.0
4                 Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
5                                     Allen, Mr. William Henry  35.0
...                                                        ...   ...
887                                      Montvila, Rev. Juozas  27.0
888                               Graham, Miss. Margaret Edith  19.0
889                   Johnston, Miss. Catherine Helen "Carrie"   NaN
890                                      Behr, Mr. Karl Howell  26.0
891                                        Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]
====================================================================================================
                                                          Name   Age
PassengerId
891                                        Dooley, Mr. Patrick  32.0
890                                      Behr, Mr. Karl Howell  26.0
889                   Johnston, Miss. Catherine Helen "Carrie"   NaN
888                               Graham, Miss. Margaret Edith  19.0
887                                      Montvila, Rev. Juozas  27.0
...                                                        ...   ...
5                                     Allen, Mr. William Henry  35.0
4                 Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
3                                       Heikkinen, Miss. Laina  26.0
2            Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
1                                      Braund, Mr. Owen Harris  22.0

[891 rows x 2 columns]

In [111]:
# sort the order of columns by the name of the column

# axis parmeter refers to sort the column's order or row's order(index), default 0 -> row(index) and 1 -> column(by name of columns)
sortedDf = sortedDf.sort_index(axis=1)

print(sortedDf)

              Age Cabin Embarked     Fare  \
PassengerId
891          32.0   NaN        Q   7.7500
890          26.0  C148        C  30.0000
889           NaN   NaN        S  23.4500
888          19.0   B42        S  30.0000
887          27.0   NaN        S  13.0000
...           ...   ...      ...      ...
5            35.0   NaN        S   8.0500
4            35.0  C123        S  53.1000
3            26.0   NaN        S   7.9250
2            38.0   C85        C  71.2833
1            22.0   NaN        S   7.2500

                                                          Name  Parch  Pclass  \
PassengerId
891                                        Dooley, Mr. Patrick      0       3
890                                      Behr, Mr. Karl Howell      0       1
889                   Johnston, Miss. Catherine Helen "Carrie"      2       3
888                               Graham, Miss. Margaret Edith      0       1
887                                      Montvila, Rev. Juozas      0       2
...                                                        ...    ...     ...
5                                     Allen, Mr. William Henry      0       3
4                 Futrelle, Mrs. Jacques Heath (Lily May Peel)      0       1
3                                       Heikkinen, Miss. Laina      0       3
2            Cumings, Mrs. John Bradley (Florence Briggs Th...      0       1
1                                      Braund, Mr. Owen Harris      0       3

                Sex  SibSp  Survived            Ticket
PassengerId
891            male      0         0            370376
890            male      0         1            111369
889          female      1         0        W./C. 6607
888          female      0         1            112053
887            male      0         0            211536
...             ...    ...       ...               ...
5              male      0         0            373450
4            female      1         1            113803
3            female      0         1  STON/O2. 3101282
2            female      1         1          PC 17599
1              male      1         0         A/5 21171

[891 rows x 11 columns]

In [ ]:
_in